MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4480/mcu.h
extern volatile B1SIDHbits_t B1SIDHbits __at(0xE31);
// bitfield macros
#define _B1SIDH_SID3_POSN                                   0x0
#define _B1SIDH_SID3_POSITION                               0x0
#define _B1SIDH_SID3_SIZE                                   0x1
#define _B1SIDH_SID3_LENGTH                                 0x1
#define _B1SIDH_SID3_MASK                                   0x1
#define _B1SIDH_SID4_POSN                                   0x1
#define _B1SIDH_SID4_POSITION                               0x1
#define _B1SIDH_SID4_SIZE                                   0x1
#define _B1SIDH_SID4_LENGTH                                 0x1
#define _B1SIDH_SID4_MASK                                   0x2
#define _B1SIDH_SID5_POSN                                   0x2
#define _B1SIDH_SID5_POSITION                               0x2
#define _B1SIDH_SID5_SIZE                                   0x1
#define _B1SIDH_SID5_LENGTH                                 0x1
#define _B1SIDH_SID5_MASK                                   0x4
#define _B1SIDH_SID6_POSN                                   0x3
#define _B1SIDH_SID6_POSITION                               0x3
#define _B1SIDH_SID6_SIZE                                   0x1
#define _B1SIDH_SID6_LENGTH                                 0x1
#define _B1SIDH_SID6_MASK                                   0x8
#define _B1SIDH_SID7_POSN                                   0x4
#define _B1SIDH_SID7_POSITION                               0x4
#define _B1SIDH_SID7_SIZE                                   0x1
#define _B1SIDH_SID7_LENGTH                                 0x1
#define _B1SIDH_SID7_MASK                                   0x10
#define _B1SIDH_SID8_POSN                                   0x5
#define _B1SIDH_SID8_POSITION                               0x5
#define _B1SIDH_SID8_SIZE                                   0x1
#define _B1SIDH_SID8_LENGTH                                 0x1
#define _B1SIDH_SID8_MASK                                   0x20
#define _B1SIDH_SID9_POSN                                   0x6
#define _B1SIDH_SID9_POSITION                               0x6
#define _B1SIDH_SID9_SIZE                                   0x1
#define _B1SIDH_SID9_LENGTH                                 0x1
#define _B1SIDH_SID9_MASK                                   0x40
#define _B1SIDH_SID10_POSN                                  0x7
#define _B1SIDH_SID10_POSITION                              0x7
#define _B1SIDH_SID10_SIZE                                  0x1
#define _B1SIDH_SID10_LENGTH                                0x1
#define _B1SIDH_SID10_MASK                                  0x80
#define _B1SIDH_B1SID3_POSN                                 0x0
#define _B1SIDH_B1SID3_POSITION                             0x0
#define _B1SIDH_B1SID3_SIZE                                 0x1
#define _B1SIDH_B1SID3_LENGTH                               0x1
#define _B1SIDH_B1SID3_MASK                                 0x1
#define _B1SIDH_B1SID4_POSN                                 0x1
#define _B1SIDH_B1SID4_POSITION                             0x1
#define _B1SIDH_B1SID4_SIZE                                 0x1
#define _B1SIDH_B1SID4_LENGTH                               0x1
#define _B1SIDH_B1SID4_MASK                                 0x2
#define _B1SIDH_B1SID5_POSN                                 0x2
#define _B1SIDH_B1SID5_POSITION                             0x2
#define _B1SIDH_B1SID5_SIZE                                 0x1
#define _B1SIDH_B1SID5_LENGTH                               0x1
#define _B1SIDH_B1SID5_MASK                                 0x4
#define _B1SIDH_B1SID6_POSN                                 0x3
#define _B1SIDH_B1SID6_POSITION                             0x3
#define _B1SIDH_B1SID6_SIZE                                 0x1
#define _B1SIDH_B1SID6_LENGTH                               0x1
#define _B1SIDH_B1SID6_MASK                                 0x8
#define _B1SIDH_B1SID7_POSN                                 0x4
#define _B1SIDH_B1SID7_POSITION                             0x4
#define _B1SIDH_B1SID7_SIZE                                 0x1
#define _B1SIDH_B1SID7_LENGTH                               0x1
#define _B1SIDH_B1SID7_MASK                                 0x10
#define _B1SIDH_B1SID8_POSN                                 0x5
#define _B1SIDH_B1SID8_POSITION                             0x5
#define _B1SIDH_B1SID8_SIZE                                 0x1
#define _B1SIDH_B1SID8_LENGTH                               0x1
#define _B1SIDH_B1SID8_MASK                                 0x20
#define _B1SIDH_B1SID9_POSN                                 0x6
#define _B1SIDH_B1SID9_POSITION                             0x6
#define _B1SIDH_B1SID9_SIZE                                 0x1
#define _B1SIDH_B1SID9_LENGTH                               0x1
#define _B1SIDH_B1SID9_MASK                                 0x40
#define _B1SIDH_B1SID10_POSN                                0x7
#define _B1SIDH_B1SID10_POSITION                            0x7
#define _B1SIDH_B1SID10_SIZE                                0x1
#define _B1SIDH_B1SID10_LENGTH                              0x1
#define _B1SIDH_B1SID10_MASK                                0x80

// Register: B1SIDL
#define B1SIDL B1SIDL
extern volatile unsigned char           B1SIDL              __at(0xE32);
#ifndef _LIB_BUILD
asm("B1SIDL equ 0E32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXID                   :1;
    };
    struct {
        unsigned B1EID16                :1;
        unsigned B1EID17                :1;
        unsigned                        :1;
        unsigned B1EXID                 :1;
        unsigned B1SRR                  :1;
        unsigned B1SID0                 :1;
        unsigned B1SID1                 :1;
        unsigned B1SID2                 :1;
    };
} B1SIDLbits_t;
extern volatile B1SIDLbits_t B1SIDLbits __at(0xE32);
// bitfield macros
#define _B1SIDL_EID16_POSN                                  0x0
#define _B1SIDL_EID16_POSITION                              0x0
#define _B1SIDL_EID16_SIZE                                  0x1
#define _B1SIDL_EID16_LENGTH                                0x1
#define _B1SIDL_EID16_MASK                                  0x1
#define _B1SIDL_EID17_POSN                                  0x1
#define _B1SIDL_EID17_POSITION                              0x1
#define _B1SIDL_EID17_SIZE                                  0x1
#define _B1SIDL_EID17_LENGTH                                0x1
#define _B1SIDL_EID17_MASK                                  0x2
#define _B1SIDL_EXIDE_POSN                                  0x3
#define _B1SIDL_EXIDE_POSITION                              0x3
#define _B1SIDL_EXIDE_SIZE                                  0x1
#define _B1SIDL_EXIDE_LENGTH                                0x1
#define _B1SIDL_EXIDE_MASK                                  0x8
#define _B1SIDL_SRR_POSN                                    0x4
#define _B1SIDL_SRR_POSITION                                0x4
#define _B1SIDL_SRR_SIZE                                    0x1
#define _B1SIDL_SRR_LENGTH                                  0x1
#define _B1SIDL_SRR_MASK                                    0x10
#define _B1SIDL_SID0_POSN                                   0x5
#define _B1SIDL_SID0_POSITION                               0x5
#define _B1SIDL_SID0_SIZE                                   0x1
#define _B1SIDL_SID0_LENGTH                                 0x1
#define _B1SIDL_SID0_MASK                                   0x20
#define _B1SIDL_SID1_POSN                                   0x6
#define _B1SIDL_SID1_POSITION                               0x6
#define _B1SIDL_SID1_SIZE                                   0x1
#define _B1SIDL_SID1_LENGTH                                 0x1
#define _B1SIDL_SID1_MASK                                   0x40
#define _B1SIDL_SID2_POSN                                   0x7
#define _B1SIDL_SID2_POSITION                               0x7
#define _B1SIDL_SID2_SIZE                                   0x1
#define _B1SIDL_SID2_LENGTH                                 0x1
#define _B1SIDL_SID2_MASK                                   0x80
#define _B1SIDL_EXID_POSN                                   0x3
#define _B1SIDL_EXID_POSITION                               0x3
#define _B1SIDL_EXID_SIZE                                   0x1
#define _B1SIDL_EXID_LENGTH                                 0x1
#define _B1SIDL_EXID_MASK                                   0x8
#define _B1SIDL_B1EID16_POSN                                0x0
#define _B1SIDL_B1EID16_POSITION                            0x0
#define _B1SIDL_B1EID16_SIZE                                0x1
#define _B1SIDL_B1EID16_LENGTH                              0x1
#define _B1SIDL_B1EID16_MASK                                0x1
#define _B1SIDL_B1EID17_POSN                                0x1
#define _B1SIDL_B1EID17_POSITION                            0x1
#define _B1SIDL_B1EID17_SIZE                                0x1
#define _B1SIDL_B1EID17_LENGTH                              0x1
#define _B1SIDL_B1EID17_MASK                                0x2
#define _B1SIDL_B1EXID_POSN                                 0x3
#define _B1SIDL_B1EXID_POSITION                             0x3
#define _B1SIDL_B1EXID_SIZE                                 0x1
#define _B1SIDL_B1EXID_LENGTH                               0x1
#define _B1SIDL_B1EXID_MASK                                 0x8
#define _B1SIDL_B1SRR_POSN                                  0x4
#define _B1SIDL_B1SRR_POSITION                              0x4
#define _B1SIDL_B1SRR_SIZE                                  0x1
#define _B1SIDL_B1SRR_LENGTH                                0x1
#define _B1SIDL_B1SRR_MASK                                  0x10
#define _B1SIDL_B1SID0_POSN                                 0x5
#define _B1SIDL_B1SID0_POSITION                             0x5
#define _B1SIDL_B1SID0_SIZE                                 0x1
#define _B1SIDL_B1SID0_LENGTH                               0x1
#define _B1SIDL_B1SID0_MASK                                 0x20
#define _B1SIDL_B1SID1_POSN                                 0x6
#define _B1SIDL_B1SID1_POSITION                             0x6
#define _B1SIDL_B1SID1_SIZE                                 0x1
#define _B1SIDL_B1SID1_LENGTH                               0x1
#define _B1SIDL_B1SID1_MASK                                 0x40
#define _B1SIDL_B1SID2_POSN                                 0x7
#define _B1SIDL_B1SID2_POSITION                             0x7
#define _B1SIDL_B1SID2_SIZE                                 0x1
#define _B1SIDL_B1SID2_LENGTH                               0x1
#define _B1SIDL_B1SID2_MASK                                 0x80

// Register: B1EIDH
#define B1EIDH B1EIDH
extern volatile unsigned char           B1EIDH              __at(0xE33);
#ifndef _LIB_BUILD
asm("B1EIDH equ 0E33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B1EID8                 :1;
        unsigned B1EID9                 :1;
        unsigned B1EID10                :1;
        unsigned B1EID11                :1;
        unsigned B1EID12                :1;
        unsigned B1EID13                :1;
        unsigned B1EID14                :1;
        unsigned B1EID15                :1;
    };
} B1EIDHbits_t;
extern volatile B1EIDHbits_t B1EIDHbits __at(0xE33);
// bitfield macros
#define _B1EIDH_EID8_POSN                                   0x0
#define _B1EIDH_EID8_POSITION                               0x0
#define _B1EIDH_EID8_SIZE                                   0x1
#define _B1EIDH_EID8_LENGTH                                 0x1
#define _B1EIDH_EID8_MASK                                   0x1
#define _B1EIDH_EID9_POSN                                   0x1
#define _B1EIDH_EID9_POSITION                               0x1
#define _B1EIDH_EID9_SIZE                                   0x1
#define _B1EIDH_EID9_LENGTH                                 0x1
#define _B1EIDH_EID9_MASK                                   0x2
#define _B1EIDH_EID10_POSN                                  0x2
#define _B1EIDH_EID10_POSITION                              0x2
#define _B1EIDH_EID10_SIZE                                  0x1
#define _B1EIDH_EID10_LENGTH                                0x1
#define _B1EIDH_EID10_MASK                                  0x4
#define _B1EIDH_EID11_POSN                                  0x3
#define _B1EIDH_EID11_POSITION                              0x3
#define _B1EIDH_EID11_SIZE                                  0x1
#define _B1EIDH_EID11_LENGTH                                0x1
#define _B1EIDH_EID11_MASK                                  0x8
#define _B1EIDH_EID12_POSN                                  0x4
#define _B1EIDH_EID12_POSITION                              0x4
#define _B1EIDH_EID12_SIZE                                  0x1
#define _B1EIDH_EID12_LENGTH                                0x1
#define _B1EIDH_EID12_MASK                                  0x10
#define _B1EIDH_EID13_POSN                                  0x5
#define _B1EIDH_EID13_POSITION                              0x5
#define _B1EIDH_EID13_SIZE                                  0x1
#define _B1EIDH_EID13_LENGTH                                0x1
#define _B1EIDH_EID13_MASK                                  0x20
#define _B1EIDH_EID14_POSN                                  0x6
#define _B1EIDH_EID14_POSITION                              0x6
#define _B1EIDH_EID14_SIZE                                  0x1
#define _B1EIDH_EID14_LENGTH                                0x1
#define _B1EIDH_EID14_MASK                                  0x40
#define _B1EIDH_EID15_POSN                                  0x7
#define _B1EIDH_EID15_POSITION                              0x7
#define _B1EIDH_EID15_SIZE                                  0x1
#define _B1EIDH_EID15_LENGTH                                0x1
#define _B1EIDH_EID15_MASK                                  0x80
#define _B1EIDH_B1EID8_POSN                                 0x0
#define _B1EIDH_B1EID8_POSITION                             0x0
#define _B1EIDH_B1EID8_SIZE                                 0x1
#define _B1EIDH_B1EID8_LENGTH                               0x1
#define _B1EIDH_B1EID8_MASK                                 0x1
#define _B1EIDH_B1EID9_POSN                                 0x1
#define _B1EIDH_B1EID9_POSITION                             0x1
#define _B1EIDH_B1EID9_SIZE                                 0x1
#define _B1EIDH_B1EID9_LENGTH                               0x1
#define _B1EIDH_B1EID9_MASK                                 0x2
#define _B1EIDH_B1EID10_POSN                                0x2
#define _B1EIDH_B1EID10_POSITION                            0x2
#define _B1EIDH_B1EID10_SIZE                                0x1
#define _B1EIDH_B1EID10_LENGTH                              0x1
#define _B1EIDH_B1EID10_MASK                                0x4
#define _B1EIDH_B1EID11_POSN                                0x3
#define _B1EIDH_B1EID11_POSITION                            0x3
#define _B1EIDH_B1EID11_SIZE                                0x1
#define _B1EIDH_B1EID11_LENGTH                              0x1
#define _B1EIDH_B1EID11_MASK                                0x8
#define _B1EIDH_B1EID12_POSN                                0x4
#define _B1EIDH_B1EID12_POSITION                            0x4
#define _B1EIDH_B1EID12_SIZE                                0x1
#define _B1EIDH_B1EID12_LENGTH                              0x1
#define _B1EIDH_B1EID12_MASK                                0x10
#define _B1EIDH_B1EID13_POSN                                0x5
#define _B1EIDH_B1EID13_POSITION                            0x5
#define _B1EIDH_B1EID13_SIZE                                0x1
#define _B1EIDH_B1EID13_LENGTH                              0x1
#define _B1EIDH_B1EID13_MASK                                0x20
#define _B1EIDH_B1EID14_POSN                                0x6
#define _B1EIDH_B1EID14_POSITION                            0x6
#define _B1EIDH_B1EID14_SIZE                                0x1
#define _B1EIDH_B1EID14_LENGTH                              0x1
#define _B1EIDH_B1EID14_MASK                                0x40
#define _B1EIDH_B1EID15_POSN                                0x7
#define _B1EIDH_B1EID15_POSITION                            0x7
#define _B1EIDH_B1EID15_SIZE                                0x1
#define _B1EIDH_B1EID15_LENGTH                              0x1
#define _B1EIDH_B1EID15_MASK                                0x80

// Register: B1EIDL
#define B1EIDL B1EIDL
extern volatile unsigned char           B1EIDL              __at(0xE34);
#ifndef _LIB_BUILD
asm("B1EIDL equ 0E34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B1EID0                 :1;
        unsigned B1EID1                 :1;
        unsigned B1EID2                 :1;
        unsigned B1EID3                 :1;
        unsigned B1EID4                 :1;
        unsigned B1EID5                 :1;
        unsigned B1EID6                 :1;
        unsigned B1EID7                 :1;
    };
} B1EIDLbits_t;
