MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4480/mcu.h
extern volatile TXB0D1bits_t TXB0D1bits __at(0xF47);
// bitfield macros
#define _TXB0D1_TXB0D10_POSN                                0x0
#define _TXB0D1_TXB0D10_POSITION                            0x0
#define _TXB0D1_TXB0D10_SIZE                                0x1
#define _TXB0D1_TXB0D10_LENGTH                              0x1
#define _TXB0D1_TXB0D10_MASK                                0x1
#define _TXB0D1_TXB0D11_POSN                                0x1
#define _TXB0D1_TXB0D11_POSITION                            0x1
#define _TXB0D1_TXB0D11_SIZE                                0x1
#define _TXB0D1_TXB0D11_LENGTH                              0x1
#define _TXB0D1_TXB0D11_MASK                                0x2
#define _TXB0D1_TXB0D12_POSN                                0x2
#define _TXB0D1_TXB0D12_POSITION                            0x2
#define _TXB0D1_TXB0D12_SIZE                                0x1
#define _TXB0D1_TXB0D12_LENGTH                              0x1
#define _TXB0D1_TXB0D12_MASK                                0x4
#define _TXB0D1_TXB0D13_POSN                                0x3
#define _TXB0D1_TXB0D13_POSITION                            0x3
#define _TXB0D1_TXB0D13_SIZE                                0x1
#define _TXB0D1_TXB0D13_LENGTH                              0x1
#define _TXB0D1_TXB0D13_MASK                                0x8
#define _TXB0D1_TXB0D14_POSN                                0x4
#define _TXB0D1_TXB0D14_POSITION                            0x4
#define _TXB0D1_TXB0D14_SIZE                                0x1
#define _TXB0D1_TXB0D14_LENGTH                              0x1
#define _TXB0D1_TXB0D14_MASK                                0x10
#define _TXB0D1_TXB0D15_POSN                                0x5
#define _TXB0D1_TXB0D15_POSITION                            0x5
#define _TXB0D1_TXB0D15_SIZE                                0x1
#define _TXB0D1_TXB0D15_LENGTH                              0x1
#define _TXB0D1_TXB0D15_MASK                                0x20
#define _TXB0D1_TXB0D16_POSN                                0x6
#define _TXB0D1_TXB0D16_POSITION                            0x6
#define _TXB0D1_TXB0D16_SIZE                                0x1
#define _TXB0D1_TXB0D16_LENGTH                              0x1
#define _TXB0D1_TXB0D16_MASK                                0x40
#define _TXB0D1_TXB0D17_POSN                                0x7
#define _TXB0D1_TXB0D17_POSITION                            0x7
#define _TXB0D1_TXB0D17_SIZE                                0x1
#define _TXB0D1_TXB0D17_LENGTH                              0x1
#define _TXB0D1_TXB0D17_MASK                                0x80

// Register: TXB0D2
#define TXB0D2 TXB0D2
extern volatile unsigned char           TXB0D2              __at(0xF48);
#ifndef _LIB_BUILD
asm("TXB0D2 equ 0F48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D20                :1;
        unsigned TXB0D21                :1;
        unsigned TXB0D22                :1;
        unsigned TXB0D23                :1;
        unsigned TXB0D24                :1;
        unsigned TXB0D25                :1;
        unsigned TXB0D26                :1;
        unsigned TXB0D27                :1;
    };
} TXB0D2bits_t;
extern volatile TXB0D2bits_t TXB0D2bits __at(0xF48);
// bitfield macros
#define _TXB0D2_TXB0D20_POSN                                0x0
#define _TXB0D2_TXB0D20_POSITION                            0x0
#define _TXB0D2_TXB0D20_SIZE                                0x1
#define _TXB0D2_TXB0D20_LENGTH                              0x1
#define _TXB0D2_TXB0D20_MASK                                0x1
#define _TXB0D2_TXB0D21_POSN                                0x1
#define _TXB0D2_TXB0D21_POSITION                            0x1
#define _TXB0D2_TXB0D21_SIZE                                0x1
#define _TXB0D2_TXB0D21_LENGTH                              0x1
#define _TXB0D2_TXB0D21_MASK                                0x2
#define _TXB0D2_TXB0D22_POSN                                0x2
#define _TXB0D2_TXB0D22_POSITION                            0x2
#define _TXB0D2_TXB0D22_SIZE                                0x1
#define _TXB0D2_TXB0D22_LENGTH                              0x1
#define _TXB0D2_TXB0D22_MASK                                0x4
#define _TXB0D2_TXB0D23_POSN                                0x3
#define _TXB0D2_TXB0D23_POSITION                            0x3
#define _TXB0D2_TXB0D23_SIZE                                0x1
#define _TXB0D2_TXB0D23_LENGTH                              0x1
#define _TXB0D2_TXB0D23_MASK                                0x8
#define _TXB0D2_TXB0D24_POSN                                0x4
#define _TXB0D2_TXB0D24_POSITION                            0x4
#define _TXB0D2_TXB0D24_SIZE                                0x1
#define _TXB0D2_TXB0D24_LENGTH                              0x1
#define _TXB0D2_TXB0D24_MASK                                0x10
#define _TXB0D2_TXB0D25_POSN                                0x5
#define _TXB0D2_TXB0D25_POSITION                            0x5
#define _TXB0D2_TXB0D25_SIZE                                0x1
#define _TXB0D2_TXB0D25_LENGTH                              0x1
#define _TXB0D2_TXB0D25_MASK                                0x20
#define _TXB0D2_TXB0D26_POSN                                0x6
#define _TXB0D2_TXB0D26_POSITION                            0x6
#define _TXB0D2_TXB0D26_SIZE                                0x1
#define _TXB0D2_TXB0D26_LENGTH                              0x1
#define _TXB0D2_TXB0D26_MASK                                0x40
#define _TXB0D2_TXB0D27_POSN                                0x7
#define _TXB0D2_TXB0D27_POSITION                            0x7
#define _TXB0D2_TXB0D27_SIZE                                0x1
#define _TXB0D2_TXB0D27_LENGTH                              0x1
#define _TXB0D2_TXB0D27_MASK                                0x80

// Register: TXB0D3
#define TXB0D3 TXB0D3
extern volatile unsigned char           TXB0D3              __at(0xF49);
#ifndef _LIB_BUILD
asm("TXB0D3 equ 0F49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D30                :1;
        unsigned TXB0D31                :1;
        unsigned TXB0D32                :1;
        unsigned TXB0D33                :1;
        unsigned TXB0D34                :1;
        unsigned TXB0D35                :1;
        unsigned TXB0D36                :1;
        unsigned TXB0D37                :1;
    };
} TXB0D3bits_t;
extern volatile TXB0D3bits_t TXB0D3bits __at(0xF49);
// bitfield macros
#define _TXB0D3_TXB0D30_POSN                                0x0
#define _TXB0D3_TXB0D30_POSITION                            0x0
#define _TXB0D3_TXB0D30_SIZE                                0x1
#define _TXB0D3_TXB0D30_LENGTH                              0x1
#define _TXB0D3_TXB0D30_MASK                                0x1
#define _TXB0D3_TXB0D31_POSN                                0x1
#define _TXB0D3_TXB0D31_POSITION                            0x1
#define _TXB0D3_TXB0D31_SIZE                                0x1
#define _TXB0D3_TXB0D31_LENGTH                              0x1
#define _TXB0D3_TXB0D31_MASK                                0x2
#define _TXB0D3_TXB0D32_POSN                                0x2
#define _TXB0D3_TXB0D32_POSITION                            0x2
#define _TXB0D3_TXB0D32_SIZE                                0x1
#define _TXB0D3_TXB0D32_LENGTH                              0x1
#define _TXB0D3_TXB0D32_MASK                                0x4
#define _TXB0D3_TXB0D33_POSN                                0x3
#define _TXB0D3_TXB0D33_POSITION                            0x3
#define _TXB0D3_TXB0D33_SIZE                                0x1
#define _TXB0D3_TXB0D33_LENGTH                              0x1
#define _TXB0D3_TXB0D33_MASK                                0x8
#define _TXB0D3_TXB0D34_POSN                                0x4
#define _TXB0D3_TXB0D34_POSITION                            0x4
#define _TXB0D3_TXB0D34_SIZE                                0x1
#define _TXB0D3_TXB0D34_LENGTH                              0x1
#define _TXB0D3_TXB0D34_MASK                                0x10
#define _TXB0D3_TXB0D35_POSN                                0x5
#define _TXB0D3_TXB0D35_POSITION                            0x5
#define _TXB0D3_TXB0D35_SIZE                                0x1
#define _TXB0D3_TXB0D35_LENGTH                              0x1
#define _TXB0D3_TXB0D35_MASK                                0x20
#define _TXB0D3_TXB0D36_POSN                                0x6
#define _TXB0D3_TXB0D36_POSITION                            0x6
#define _TXB0D3_TXB0D36_SIZE                                0x1
#define _TXB0D3_TXB0D36_LENGTH                              0x1
#define _TXB0D3_TXB0D36_MASK                                0x40
#define _TXB0D3_TXB0D37_POSN                                0x7
#define _TXB0D3_TXB0D37_POSITION                            0x7
#define _TXB0D3_TXB0D37_SIZE                                0x1
#define _TXB0D3_TXB0D37_LENGTH                              0x1
#define _TXB0D3_TXB0D37_MASK                                0x80

// Register: TXB0D4
#define TXB0D4 TXB0D4
extern volatile unsigned char           TXB0D4              __at(0xF4A);
#ifndef _LIB_BUILD
asm("TXB0D4 equ 0F4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D40                :1;
        unsigned TXB0D41                :1;
        unsigned TXB0D42                :1;
        unsigned TXB0D43                :1;
        unsigned TXB0D44                :1;
        unsigned TXB0D45                :1;
        unsigned TXB0D46                :1;
        unsigned TXB0D47                :1;
    };
} TXB0D4bits_t;
